#! /bin/bash

__author__ = 'zzj'
'''
题目：809*??=800*??+9*?? 其中??代表的两位数, 809*??为四位数，8*??的结果为两位数，9*??的结果为3位数。求??代表的两位数，及809*??后的结果。
'''
n = 10
while True:
    if (809 * n == 800 * n + 9 * n) and (1000 <= 809 * n < 10000) and (10 <= 8 * n < 100) and (100 <= 9 * n < 1000):
        break
    n += 1
    print(n)
    if n >= 100:
        break

print(f"??代表的两位数为：{n}")
print(f"809*??后的结果为：{809 * n}")

#####################################################
a = 809
for i in range(10, 100):
    b = i * a
    if b >= 1000 and b <= 10000 and 8 * i < 100 and 9 * i >= 100:
        print(b, ' = 800 * ', i, ' + 9 * ', i)
